// МІНІМУМ
// 1) Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.
// let a = 0.1;
// let b = 0.2;
// let result = a + b;
// alert(result.toFixed(1));

// 2) Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

// let str = '1';
// let num = 2;
// let result = +1 + 2;
// alert (result);

// 3) Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

// let flash = prompt('Вкажіть обсяг флешки в ГБ?', 0);
// let size = 820;
// let result = Math.floor(flash * 1000 / size);
// alert (`На флешку розміром ${flash} ГБ, поміститься ${result} файлів розміром ${size} Мб`);

// НОРМА
// 1) Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.
// let wallet = prompt('Вкажіть суму грошей яку ви маєте?', 0);
// let chocolate = prompt('Яка ціна однієї шоколадки?', 0);
// let result = Math.round(wallet / chocolate);
// alert(`Ви можете купити ${result} шоколадок`);
// let balance = wallet % chocolate;
// alert (`У Вас залишилось ${balance} грн.`);

// 2) Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор % (залишок від ділення).

// let number = prompt ('Вкажіть тризначне число?', 0);
// let reverse = number[2] + number[1] + number[0];
// alert(reverse);

// МАКСИМУМ
// 1) Користувач вводить суму вкладу в банк на 2 місяці, з процентною ставкою депозиту 5% річних. Вивести суму нарахованих відсотків.

// let money = prompt('Вкажіть суму вкладу на 2 місяці?', 0);
// let result = +money * (5 / 100) / 6;
// alert (`Сума нарахованих відсотків: ${result}`);
